
nc: 14
nm: 4
nw: 10

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Shared Backbone (Low-Level Features)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]                  # 0  - P1/2
  - [-1, 1, Conv, [128, 3, 2]]                 # 1  - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]          # 2

head:
  # ==========================================
  # BRANCH 1: DRIVING (Heatmap + Trajectory)
  # ==========================================
  # Driving Stem
  - [2, 1, Conv, [256, 3, 2]]                  # 3  - P3/8 (Driving)
  - [-1, 2, C3k2, [512, False, 0.25]]          # 4  (P3 features)
  - [-1, 1, Conv, [512, 3, 2]]                 # 5  - P4/16 (Driving)
  - [-1, 2, C3k2, [512, True]]                 # 6  (P4 features)
  - [-1, 1, Conv, [1024, 3, 2]]                # 7  - P5/32 (Driving)
  - [-1, 2, C3k2, [1024, True]]                # 8
  - [-1, 1, SPPF, [1024, 5]]                   # 9
  - [-1, 2, C2PSA, [1024]]                     # 10 (P5 features)

  # Language Fusion for Driving
  - [10, 1, LanguagePromptEncoder, [256, nm, 'embedding']] # 11
  - [10, 1, Conv, [256, 1, 1]]                              # 12 (Compress P5)
  - [[12, 11], 1, VLFusion, [256, 256]]                     # 13 (Fuse Compressed P5 with Command)

  # Driving Neck (FPN)
  - [13, 1, SPPF, [256, 5]]                      # 14 (Fused P5 → SPPF)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 15
  - [[-1, 6], 1, Concat, [1]]                     # 16 (cat P5_up + P4)
  - [-1, 2, C3k2, [128, 1]]                       # 17 (P4_neck)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 18
  - [[-1, 4], 1, Concat, [1]]                     # 19 (cat P4_neck_up + P3)
  - [-1, 2, C3k2, [64, 1]]                        # 20 (P3_neck)

  - [-1, 1, Conv, [64, 3, 2]]                     # 21
  - [[-1, 17], 1, Concat, [1]]                    # 22 (cat P3_down + P4_neck)
  - [-1, 2, C3k2, [128, 1]]                       # 23

  - [-1, 1, Conv, [128, 3, 2]]                    # 24
  - [[-1, 14], 1, Concat, [1]]                    # 25 (cat P4_down + fused P5)
  - [-1, 2, C3k2, [256, 1]]                       # 26

  # Driving Heads
  - [[20, 1], 1, HeatmapHead, [1, 64, 3]]         # 27 (Heatmap: P3_neck + Shared P2)
  - [[26, 27], 1, TrajectoryHead, [nm, nw]]        # 28 (Trajectory: P5 + heatmap context)
  - [26, 1, ClassificationHead, [nm]]              # 29 (Commands: P5)

  # BRANCH 2: PERCEPTION (Detection)
  # Perception Stem
  - [2, 1, Conv, [256, 3, 2]]                  # 30  - P3/8 (Perception)
  - [-1, 2, C3k2, [512, False, 0.25]]          # 31  (P3 features)
  - [-1, 1, Conv, [512, 3, 2]]                 # 32  - P4/16 (Perception)
  - [-1, 2, C3k2, [512, True]]                 # 33  (P4 features)
  - [-1, 1, Conv, [1024, 3, 2]]                # 34  - P5/32 (Perception)
  - [-1, 2, C3k2, [1024, True]]                # 35
  - [-1, 1, SPPF, [1024, 5]]                   # 36
  - [-1, 2, C2PSA, [1024]]                     # 37 (P5 features)

  # Perception Neck (FPN)
  - [37, 1, SPPF, [256, 5]]                      # 38
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 39
  - [[-1, 33], 1, Concat, [1]]                    # 40 (cat P5_up + P4)
  - [-1, 2, C3k2, [128, 1]]                       # 41 (P4_neck)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 42
  - [[-1, 31], 1, Concat, [1]]                    # 43 (cat P4_neck_up + P3)
  - [-1, 2, C3k2, [64, 1]]                        # 44 (P3_neck)

  - [-1, 1, Conv, [64, 3, 2]]                     # 45
  - [[-1, 41], 1, Concat, [1]]                    # 46 (cat P3_down + P4_neck)
  - [-1, 2, C3k2, [128, 1]]                       # 47

  - [-1, 1, Conv, [128, 3, 2]]                    # 48
  - [[-1, 38], 1, Concat, [1]]                    # 49 (cat P4_down + P5)
  - [-1, 2, C3k2, [256, 1]]                       # 50

  # Perception Head
  - [[44, 47, 50], 1, Detect, [nc]]               # 51 (Detection: P3, P4, P5)
