# NeuroPilot with YOLO11 Backbone
# Conv-based backbone (no TimmBackbone) + Language Fusion + NeuroPilot multi-task heads
# Architecture: YOLO11 backbone → Command Fusion → FPN neck → MT Heads

# Parameters
nc: 14
nm: 4
nw: 10

scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11-style Backbone (Conv-based, no Timm dependency)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                  # 0  - P1/2
  - [-1, 1, Conv, [128, 3, 2]]                 # 1  - P2/4  (skip for HeatmapHead)
  - [-1, 2, C3k2, [256, False, 0.25]]          # 2
  - [-1, 1, Conv, [256, 3, 2]]                 # 3  - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]          # 4  (P3 features)
  - [-1, 1, Conv, [512, 3, 2]]                 # 5  - P4/16
  - [-1, 2, C3k2, [512, True]]                 # 6  (P4 features)
  - [-1, 1, Conv, [1024, 3, 2]]                # 7  - P5/32
  - [-1, 2, C3k2, [1024, True]]                # 8
  - [-1, 1, SPPF, [1024, 5]]                   # 9
  - [-1, 2, C2PSA, [1024]]                     # 10 (P5 features)

# Head (Command Fusion + FPN Neck + Multi-Task Heads)
head:
  # --- Language & Command Fusion (inject navigation command into P5) ---
  - [10, 1, LanguagePromptEncoder, [256, nm, 'embedding']] # 11 (Command → 256ch Embedding)
  - [10, 1, Conv, [256, 1, 1]]                              # 12 (Compress P5: 1024 → 256)
  - [[12, 11], 1, VLFusion, [256, 256]]                     # 13 (Fuse Compressed P5 with Command)

  # --- FPN Neck (Top-down + Bottom-up) ---
  - [13, 1, SPPF, [256, 5]]                      # 14 (Fused P5 → SPPF)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 15
  - [[-1, 6], 1, Concat, [1]]                     # 16 (cat P5_up + P4 backbone)
  - [-1, 2, C3k2, [128, 1]]                       # 17 (P4_neck)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 18
  - [[-1, 4], 1, Concat, [1]]                     # 19 (cat P4_neck_up + P3 backbone)
  - [-1, 2, C3k2, [64, 1]]                        # 20 (P3_neck)

  - [-1, 1, Conv, [64, 3, 2]]                     # 21
  - [[-1, 17], 1, Concat, [1]]                    # 22 (cat P3_down + P4_neck)
  - [-1, 2, C3k2, [128, 1]]                       # 23

  - [-1, 1, Conv, [128, 3, 2]]                    # 24
  - [[-1, 14], 1, Concat, [1]]                    # 25 (cat P4_down + fused P5)
  - [-1, 2, C3k2, [256, 1]]                       # 26

  # --- Multi-Task Heads ---
  - [[20, 23, 26], 1, Detect, [nc]]               # 27 (Detection: P3, P4, P5)
  - [[20, 1], 1, HeatmapHead, [1, 64, 3]]         # 28 (Heatmap: P3_neck + P2_backbone)
  - [[26, 28], 1, TrajectoryHead, [nm, nw]]        # 29 (Trajectory: P5 + heatmap context)
  - [26, 1, ClassificationHead, [nm]]              # 30 (Commands: P5)
