# NeuroPilot Minimal - Detection Only
# Parameters
nc: 14 # number of classes

# Model Architecture
backbone:
  # [from, repeats, module, args]
  - [-1, 1, TimmBackbone, ['mobilenetv4_conv_small.e2400_r224_in1k', True, True]] # 0-P1/P2/P3/P4/P5

head:
  - [0, 1, SelectFeature, [4]] # 1 - P5 (stride 32)
  - [1, 1, Detect, [nc]] # 2 - Detect Head
