# NeuroPilot Nano - Edge optimized
# Parameters
nc: 14
depth_multiple: 0.33
width_multiple: 0.25

# Model Architecture
backbone:
  - [-1, 1, TimmBackbone, ['mobilenetv4_conv_small_050', True, True]] # 0

head:
  - [0, 1, SelectFeature, 4] # 1 - P5
  - [1, 1, Detect, [nc]] # 2
