# NeuroPilot Heavy - Research Grade
# Parameters
nc: 14 # number of classes

# Model Architecture
backbone:
  - [-1, 1, TimmBackbone, ['mobilenetv4_conv_medium', True, True]] # 0

head:
  - [0, 1, SelectFeature, [4]] # 1 - P5
  - [1, 1, SPPF, [256, 5]] # 2
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']] # 3
  - [0, 1, SelectFeature, [3]] # 4 - P4
  - [[3, 4], 1, Concat, [1]] # 5
  - [-1, 1, C2f, [256, 128, 3]] # 6

  - [6, 1, Detect, [nc]] # 7
  - [4, 1, ClassificationHead, [4, 0.2]] # 8 - Command/Weather/etc
