# NeuroPilot Large - Cloud/Server optimized
# Parameters
nc: 14
depth_multiple: 1.0
width_multiple: 1.0

# Model Architecture
backbone:
  - [-1, 1, TimmBackbone, ['mobilenetv4_conv_large', True, True]] # 0

head:
  - [0, 1, SelectFeature, [4]] # 1 - P5
  - [1, 1, SPPF, [512, 5]] # 2
  - [-1, 1, C3k2, [512, 1]] # 3

  - [3, 1, Detect, [nc]] # 4
  - [3, 1, ClassificationHead, [nc, 512, 0.3]] # 5 - Heavy classifier
