# Dummy Model for Testing (3-scale Detection)
nc: 14
backbone:
  - [-1, 1, Conv, [32, 3, 2]]  # 0 (P1)
  - [-1, 1, Conv, [64, 3, 2]]  # 1 (P2)
  - [-1, 1, Conv, [128, 3, 2]] # 2 (P3)
  - [-1, 1, Conv, [256, 3, 2]] # 3 (P4)
  - [-1, 1, Conv, [512, 3, 2]] # 4 (P5)
head:
  - [-1, 1, SPPF, [128, 5]]    # 5 (P5')
  - [[2, 3, 5], 1, Detect, [nc]] # 6 (Scale P3, P4, P5)
